---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.AnalyticalElement
source: html/1bcf37a7-dca8-4c45-dcc4-9b9eb0ad5c19.htm
---
# AnalyticalElement Properties

This represents the Analyze As parameter assigned to Analytical Element.